Autodesk.Revit.DB.BuiltInFailures.RoofFailures.WorkplaneShouldBeLevel
Can't use Workplane that is not a Level. Set the desired Level as current Workplane.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UserCancelledRoof
Cancelled.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UptoHeightTooLow
Cutoff Level cannot be below bottom of roof.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UnusedSlopeArrow
The tails of all slope arrows must lie on the roof boundary.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanesError
Roof cannot be joined to more than one reference plane.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanes
Roof cannot be joined to more than one reference plane.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofSlopeExceedsThreshold
Thickness of this Roof may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in
sections and details may not accurately indicate the Thickness shown in Type Properties.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentiallyError
The roofs cannot be joined because the roof being joined meets the target roof tangentially.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentially
The roofs cannot be joined because the roof being joined meets the target roof tangentially.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofExceedsMaxHeight
Roof exceeds user-specified maximum height

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofCutoffRemoved
The roof's cutoff failed and was removed; make sure the cutoff height is not below the roof.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyUpwardFacesUsed
The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyOneSlopeCurtainRoof
Only one slope in curtain roof.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.NoFlatCurtainRoofs
A Sloped Glazing with no slope is not allowed.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTargetError
Part of the roof to be joined misses the target face.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTarget
Part of the roof to be joined misses the target face.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.InvalidArcSegmentation
A segmented slope-defining arc has too few segments.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HoleInRoofFailed
Hole(s) could not be cut in roof.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HadToAlignEaves
Adjacent slope-defining lines must have identical eave heights. Eaves were aligned to higher location automatically
to avoid failure. Use the Align Eaves tool to specify desired location.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.ExtrudedRoofCutBySketch
Entire extruded Roof is cut by cut Sketch.

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsWarn
Some loops were skipped

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsError
Some loops were skipped

Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoops
Some loops were skipped

Autodesk.Revit.DB.BuiltInFailures.RoofFailures
Failures about Roof.